
'''
列表是有序集合，没有固定大小，能够保存任意数量任意类型的 Python 对象，语法为 [元素1, 元素2, ..., 元素n] 。
1. 关键点是「中括号 []」和「逗号 ,」
2. 中括号 把所有元素绑在一起
3. 逗号 将每个元素一一分开
4.由于list的元素可以是任何对象，因此列表中所保存的是对象的指针。即使保存一个简单的 [1,2,3] ，也有3个指针和3个
整数对象。
5.列表不像元组，列表内容可更改 (mutable)，因此附加 ( append , extend )、插入 ( insert )、删除 ( remove , pop ) 这些
操作都可以用在它身上。

'''
# 创建方式1:利用 range() 创建列表
x = list(range(1, 11, 2))
print(x, type(x))
# [1, 3, 5, 7, 9] <class 'list'>

# 创建方式2:利用推导式创建列表
x = [0] * 5
print(x, type(x))
# [0, 0, 0, 0, 0] <class 'list'>
x = [0 for i in range(5)]
print(x, type(x))
# [0, 0, 0, 0, 0] <class 'list'>


# 创建方式3:赋值创建
x = [2, 3, 4, 5, 6, 7]
print(x, type(x))
# [2, 3, 4, 5, 6, 7] <class 'list'>

# 创建一个3*4的list
x = [[0] * 3] * 4
print(x, type(x))
# [[0, 0, 0], [0, 0, 0], [0, 0, 0], [0, 0, 0]] <class 'list'>
x[0][0] = 1  # 因为存的是指针
print(x, type(x))
# [[1, 0, 0], [1, 0, 0], [1, 0, 0], [1, 0, 0]] <class 'list'>

a = [0] * 3
x = [a] * 4
print(x, type(x))
# [[0, 0, 0], [0, 0, 0], [0, 0, 0], [0, 0, 0]] <class 'list'>
x[0][0] = 1  # 因为x = [a] * 4 操作中，只是创建4个指向list的引用，所以一旦 a 改变， x 中4个 a 也会随之改变。
print(x, type(x))
# [[1, 0, 0], [1, 0, 0], [1, 0, 0], [1, 0, 0]] <class 'list'>
